#+title: My Config
#+options: num:3

* Latex tikz preamable

#+begin_src emacs-lisp
(add-to-list 'org-latex-packages-alist
             '("" "tikz" t))

(eval-after-load "preview"
  '(add-to-list 'preview-default-preamble "\\PreviewEnvironment{tikzpicture}" t))
(setq org-latex-create-formula-image-program 'dvisvgm)


(with-eval-after-load 'preview ;; Ensures 'preview.el' is fully loaded first
  ;; Use condition-case for safer modification
  (condition-case err
      (progn
        ;; Check if the variable exists and has a value before appending
        ;; If it doesn't exist or is nil, start the preamble fresh.
        (let ((existing-preamble (if (and (boundp 'preview-latex-preamble) preview-latex-preamble)
                                     (concat preview-latex-preamble "\n")
                                   "")))
          (setq preview-latex-preamble
                (concat existing-preamble
                        ;; Load necessary packages (ensure they are available)
                        "\\usepackage{xcolor} %% Needed for defining/using colors like 'white'\n"
                        "\\usepackage{tikz}\n"
                        "\\usetikzlibrary{backgrounds} %% Load the backgrounds library for TikZ\n"
                        ;; Apply settings globally *within the preview context* to all tikzpictures
                        "\\tikzset{\n"
                        "  every picture/.style={show background rectangle, %% Enable the background feature\n"
                        "                      background rectangle/.style={fill=white} %% Set the background fill to white\n"
                        "                     }\n"
                        "}\n"))))
    ;; Catch potential errors during the modification
    (error (message "Error customizing preview-latex-preamble: %s" (error-message-string err)))))

#+end_src

#+RESULTS:
: (\RequirePackage[ (, . preview-default-option-list) ]{preview}[2004/11/05] \PreviewEnvironment{tikzpicture})


* Wolfram

#+begin_src emacs-lisp
;; Load mathematica from contrib
;; Sanitize output and deal with paths
;;(setq org-babel-mathematica-command "~/.local/bin/mash")
;; (setq org-babel-mathematica-command "/Applications/Wolfram.app/Contents/MacOS/MathKernel")
;; (setq org-babel-mathematica-command "wolframscript -script")
;; ;; Font-locking
;; (add-to-list 'org-src-lang-modes '("mathematica" . wolfram))
;; ;; For wolfram-mode
;; (setq mathematica-command-line "~/.local/bin/mash")
;; (setq wolfram-path "~/.Mathematica/Applications") ;; e.g. on Linux "~/.Mathematica/Applications"
#+end_src

#+RESULTS:
: ~/.Mathematica/Applications



